In [1]:
import numpy as np 
import pandas as pd 
from datetime import datetime 

pd.set_option('display.max_colwidth', None)

In [2]:
movie_data = pd.read_csv('movies_metadata.csv',low_memory=False)
movie_data = movie_data[['id', 'title', 'genres']]

In [3]:
rating = pd.read_csv('ratings.csv')

In [4]:
rating = rating.sample(frac=0.2)

In [5]:
rating['timestamp'] = pd.to_datetime(rating['timestamp'],unit='s').dt.strftime('%Y-%m')

In [6]:
rating_year = rating
rating_year['timestamp'] = pd.to_datetime(rating_year['timestamp']).dt.strftime('%Y')

In [22]:
rating_pivot = pd.pivot_table(data = rating_year, index = 'movieId', columns = 'timestamp', values = 'rating', aggfunc= np.mean)

In [26]:
rating_pivot.tail()

timestamp,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
movieId,,,,,,,,,,,,,,,,,,
176239,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,4.5
176267,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,4.0
176271,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,5.0
176273,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0
176275,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3.0

In [25]:
rating_pivot.drop(columns= ['1996', '1997', '1998', '1999'], inplace = True )

# rating_pivot.drop(columns= ['1995', '1996', '1997', '1998', '1999'], inplace = True )

# Due to randomness of the sampling - on some cases ratings from 1995 won't appear on the DF and in some cases will

In [27]:
rating_pivot['mean'] = rating_pivot.mean(axis=1)

In [28]:
# All movies with only 1 rating since 2000 won't be included in top_ten movies due-to low rating-rate

rating_pivot.dropna(thresh=17, axis = 0, inplace= True)

rating_pivot['mean'].max()

4.435799053941917

In [29]:
toptep = rating_pivot[rating_pivot['mean']>=4.2]

In [30]:
top_movies = list(toptep.index)
top_movies = [str(a) for a in top_movies]
top_movies

['50', '296', '318', '858', '1221', '1925', '2019', '2959', '5618']

In [31]:
# Extracting the names and ID's of top profitable campaigns

top_movies_names = movie_data[movie_data['id'].isin(top_movies)]
top_movies_names.head(10)

,id,title,genres
459,2019,Hard Target,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'name': 'Adventure'}, {'id': 80, 'name': 'Crime'}, {'id': 53, 'name': 'Thriller'}]"
534,858,Sleepless in Seattle,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'name': 'Drama'}, {'id': 10749, 'name': 'Romance'}]"
4020,318,The Million Dollar Hotel,"[{'id': 18, 'name': 'Drama'}, {'id': 53, 'name': 'Thriller'}]"
6388,296,Terminator 3: Rise of the Machines,"[{'id': 28, 'name': 'Action'}, {'id': 53, 'name': 'Thriller'}, {'id': 878, 'name': 'Science Fiction'}]"
8737,5618,"Cousin, Cousine","[{'id': 10749, 'name': 'Romance'}, {'id': 35, 'name': 'Comedy'}]"
11922,2959,License to Wed,"[{'id': 35, 'name': 'Comedy'}]"

In [32]:
names = list(top_movies_names['title'])
names

['Hard Target',
 'Sleepless in Seattle',
 'The Million Dollar Hotel',
 'Terminator 3: Rise of the Machines',
 'Cousin, Cousine',
 'License to Wed']